[
  {
    "file": "experiments/experiment-1-1.js",
    "name": "Birthday Sprinkles",
    "description": "I decided to create something with Perlin noise, but I want to create it with color. It reminds me of birthday cake sprinkles!"
  },
  {
    "file": "experiments/experiment-1-2.js",
    "name": "Fire",
    "description": "For the first variation of the perlin noise, I wanted to replicate fire through linear gradients and opacity change. I got this idea since Perlin noise resembles smoke so much in its smooth movements."
  },
  {
    "file": "experiments/experiment-1-3.js",
    "name": "Disco lights",
    "description": "For this second variation of perlin noise, I integrated another color in the gradient and made the background black to create a disco effect. The squares also vary in rotation randomly."
  },
  {
    "file": "experiments/experiment-2-1.js",
    "name": "Optical illusion squares",
    "description": "For the second recreation I created these randomized squares that have different stroke weights. I was inspired by an image found on google. I liked the trippyness of it and wanted to create something similar using randomness. They also move a tiny bit up, down, left or right to create movement."
  },
  {
    "file": "experiments/experiment-2-2.js",
    "name": "Pointy flowers",
    "description": "For the first variation of the optical illusion I created these flower-like objects that have randomized color and rotation."
  },
  {
    "file": "experiments/experiment-2-3.js",
    "name": "Artsy circles",
    "description": "For the second variation of the optical illusion I created these varied the shape by makeing them ellipses with the randomized color, stroke and rotation still implemented. I also made them downsize and move father to the edges using offset radius."
  },
  {
    "file": "experiments/experiment-3-1.js",
    "name": "Marble stone",
    "description": "For the more complex experimenting, I knew I wanted to use flow fields. When working with it, the structures forming started reminding me of stone, specifically marble. So I made the backgroud gray and randomised the color of the lines between black and white using Math.random. "
  },
  {
    "file": "experiments/experiment-3-2.js",
    "name": "Flow fields version 2",
    "description": "For the second recreation of part one I created these randomized squares that have different stroke weights. I was inspired by an image found on google. I liked the trippyness of it and wanted to create something similar using randomness. They also move a tiny bit up, down, left or right to create movement."
  },
  {
    "file": "experiments/experiment-3-3.js",
    "name": "Flow fields version 3",
    "description": "For the second recreation of part one I created these randomized squares that have different stroke weights. I was inspired by an image found on google. I liked the trippyness of it and wanted to create something similar using randomness. They also move a tiny bit up, down, left or right to create movement."
  },
  {
    "file": "experiments/experiment-4.js",
    "name": "Proximity music tone.js",
    "description": "The idea is to create a something where random shapes in random size will shift the sound level, to create the effect of diffrerent proximities. "
  }
]
